In [2]:
try:
    file = open("info.csv","x")
    file.close()
except:
    print("The Info file is already exist!")

The Info file is already exist!

In [2]:
import pandas as pd
df = pd.read_csv("info.csv")
print(df)

   sr     name  age    addesss       phone
0   1      ram   34   Katmandu  9865415475
1   2  Shaayam   45  Bhaktapur  9654751236
2   3     Hari   27   Lalitpur  9845741256
3   4     Sita   52    Gowarko  9854265214
4   5     Gita   22  Sadwabato  8547562145
5   6    Nabin   25   Nuwakote  9856412031

In [11]:
# !pip install pandas
import pandas as pd
df = pd.read_csv("info.csv",nrows=5)
print(df)
df
# print(df.head(1))
# df.tail()

   sr     name  age    addesss       phone
0   1      ram   34   Katmandu  9865415475
1   2  Shaayam   45  Bhaktapur  9654751236
2   3     Hari   27   Lalitpur  9845741256
3   4     Sita   52    Gowarko  9854265214
4   5     Gita   22  Sadwabato  8547562145

   sr     name  age    addesss       phone
0   1      ram   34   Katmandu  9865415475
1   2  Shaayam   45  Bhaktapur  9654751236
2   3     Hari   27   Lalitpur  9845741256
3   4     Sita   52    Gowarko  9854265214
4   5     Gita   22  Sadwabato  8547562145

In [15]:
df = pd.read_csv("info.csv",nrows=5)
df[0:4]

   sr     name  age    addesss       phone
0   1      ram   34   Katmandu  9865415475
1   2  Shaayam   45  Bhaktapur  9654751236
2   3     Hari   27   Lalitpur  9845741256
3   4     Sita   52    Gowarko  9854265214

In [24]:
# iloc

df.iloc[0:4,1:3]

      name  age
0      ram   34
1  Shaayam   45
2     Hari   27
3     Sita   52

In [27]:
import pandas as pd
df = pd.read_csv("info.csv",usecols=['sr','name','phone'])
df

   sr     name       phone
0   1      ram  9865415475
1   2  Shaayam  9654751236
2   3     Hari  9845741256
3   4     Sita  9854265214
4   5     Gita  8547562145
5   6    Nabin  9856412031

In [30]:
import pandas as pd
df = pd.read_csv("info.csv")
list(df['name'])

['ram', 'Shaayam', 'Hari', 'Sita', 'Gita', 'Nabin']

In [33]:
import pandas as pd
df = pd.read_csv("info.csv")
df['name'] == "ram"

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [35]:
import pandas as pd
df = pd.read_csv("info.csv")
df[df['name'] == "ram"]

   sr name  age    addesss       phone
0   1  ram   34   Katmandu  9865415475
6   7  ram   56  Nagarkoat  8546325971

In [43]:
# Kind of filter of multiple colume from same data set

import pandas as pd
df = pd.read_csv("info.csv")
df[(df['name'] == "Hari")& (df['phone'] == 9845741256)]

   sr  name  age   addesss       phone
2   3  Hari   27  Lalitpur  9845741256

In [48]:
#Sorted or filters or search data can be saved to another file

import pandas as pd
df = pd.read_csv("info.csv")
data = df[(df['name'] == "Hari")& (df['phone'] == 9845741256)]
data.to_csv("info1.csv")

In [50]:
import pandas as pd
data = {'name':[],'age':[],'add':[]}
n = int(input("Enput n = "))
for i in range(n):
    name = input("Enter name = ")
    age = int(input("Enter age = "))
    add = input("Enter add = ")
    data['name'].append(name)
    data['age'].append(age)
    data['add'].append(add)
print(data)

df = pd.DataFrame(data)
df

Enput n = 2
Enter name = Bikash
Enter age = 35
Enter add = Janakpur
Enter name = Nirmal
Enter age = 45
Enter add = Jhapa
{'name': ['Bikash', 'Nirmal'], 'age': [35, 45], 'add': ['Janakpur', 'Jhapa']}

     name  age       add
0  Bikash   35  Janakpur
1  Nirmal   45     Jhapa

In [51]:
df.to_csv("Info3.csv")

In [1]:
import csv
info = []
n = int(input("ENter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = int(input("enter age = "))
    address = input("enter Address = ")
    info.append([name,age,address])
print(info)

file = open('Info4.csv','w')
x = csv.write(file)
x.writerow('name','age','address')          # for one / single roe
x.writerows(info)                           # for multiple roes
file.close()

ENter n = 2
Enter name = Gour
enter age = 25
enter Address = Lalitpur
Enter name = Bikash
enter age = 65
enter Address = Gowarko
[['Gour', 25, 'Lalitpur'], ['Bikash', 65, 'Gowarko']]

AttributeError: module 'csv' has no attribute 'write'